In [1]:
#for handling tables of data within python
import pandas

#for connection to and communication to the posgres database
import psycopg2
from psycopg2 import Error

#for making data visualizations for the reports
import plotnine

In [2]:
#store the general connection info
un = "postgres"
pw = "cs425proj"
db = "erp"

In [3]:
#check to see if db tables exist. if not, create tables
required_tables = ['inventory']

try:
    connection = psycopg2.connect(user = un,
                                  password = pw,
                                  host = "127.0.0.1",
                                  port = "5432",
                                  database = db)

    cursor = connection.cursor()
    
### Using three single quotes allows us to write multiline strings.  This is just easier to read
    
    for tab in required_tables:
        query = "SELECT * FROM " + tab + ";"
        print(query)
# # run the query
        try cursor.execute(query):
            print("Table exists in PostgreSQL ")
        except:
            create_query = 
    # commit the results
    connection.commit()

except (Exception, psycopg2.DatabaseError) as error :
    print ("Error while creating PostgreSQL table", error)
finally:
    #closing database connection.
    if(connection):
        cursor.close()
        connection.close()
        print("PostgreSQL connection is closed")

SyntaxError: invalid syntax (<ipython-input-3-6a2df606d84e>, line 19)

In [21]:
#check to see if user roles exist. if not, create roles

In [ ]:
#check to see if users exist. if not, create users

In [ ]:
#ask terminal for username and password

In [ ]:
#look up role for user

In [ ]:
#if user does not exist, throw error

In [ ]:
#if user exists, show available actions given role

In [4]:
inventory = pandas.read_csv('../erp_app/Data/inventory.csv')
inventory

   inventoryID  cost  leadTime categoryType  amount
0          101   100        10        small     100
1          102   200        10          big      75
2          103   500        90      medium       25
3          104    50         5        small     200
4          105   600        60          big      15

In [5]:
model = pandas.read_csv('../erp_app/Data/model.csv')
model

   modelNumber  salePrice  inventoryID
0         1001        150          101
1         1002        220          102
2         1003        550          103
3         1004        100          104
4         1005        625          105

In [6]:
inventory.merge(model)

   inventoryID  cost  leadTime categoryType  amount  modelNumber  salePrice
0          101   100        10        small     100         1001        150
1          102   200        10          big      75         1002        220
2          103   500        90      medium       25         1003        550
3          104    50         5        small     200         1004        100
4          105   600        60          big      15         1005        625

In [67]:
employee = pandas.read_csv('../erp_app/Data/employee.csv')
employee
employee.query('Department == "Sales"')

,employeeID,FirstName,MiddleName,LastName,Salary,Salaried,Hourly,Department
1,10002,Sherman,Ken,Yip,45000,True,False,Sales
3,10004,Sahas,Karl,Johnson,45000,True,False,Sales
4,10005,Sudeep,Sunil,Harlow,55000,True,False,Sales
7,10008,Tim,B,Crisp,55000,True,False,Sales
9,10010,Tyrone,Carter,Mayfield,45000,True,False,Sales

In [8]:
customer = pandas.read_csv('../erp_app/Data/customer.csv')
customer

   customerID FirstName    LastName
0           1     Sunni        Lynn
1           2    Carrie  Armbruster
2           3      Anke   Dabrowski
3           4     Roman      Cooper
4           5   Tameeka       Jones
5           6    Hunter       Patel
6           7     Jacob        Rose
7           8       Kim         Lee
8           9         R     Bonesly
9          10      Zach      Herper

In [9]:
order = pandas.read_csv('../erp_app/Data/order.csv')
order

    orderNumber  customerID  employeeID  modelNumber  saleValue
0        100001          10       10002         1001        NaN
1        100002           9       10002         1004        NaN
2        100003           8       10002         1002        NaN
3        100004           7       10002         1004        NaN
4        100005           1       10004         1004        NaN
5        100006           2       10005         1001        NaN
6        100007           3       10008         1004        NaN
7        100008           4       10004         1003        NaN
8        100009           5       10008         1005        NaN
9        100010           6       10005         1004        NaN
10       100011          10       10008         1005        NaN
11       100012           5       10004         1005        NaN
12       100013           6       10008         1004        NaN
13       100014           7       10004         1001        NaN
14       100015           3       10005         1004        NaN
15       100016           4       10005         1004        NaN
16       100017           5       10010         1003        NaN
17       100018           2       10010         1003        NaN
18       100019           2       10010         1001        NaN

In [73]:
employeeLogin = pandas.read_csv('../erp_app/Data/employeelogin.csv')
employeeLogin

   employeeID     userID  role
0       10001     sgreen   NaN
1       10002       syip   NaN
2       10003       skim   NaN
3       10004   sjohnson   NaN
4       10005    sharlow   NaN
5       10006  smohammad   NaN
6       10007   ssampson   NaN
7       10008     tcrisp   NaN
8       10009     tnovak   NaN
9       10010  tmayfield   NaN

In [74]:
employeeLogin = pandas.merge(employeeLogin,employee[['employeeID','Department']])
employeeLogin.head()

   employeeID    userID  role   Department
0       10001    sgreen   NaN  Engineering
1       10002      syip   NaN        Sales
2       10003      skim   NaN  Engineering
3       10004  sjohnson   NaN        Sales
4       10005   sharlow   NaN        Sales

In [75]:
employeeLogin.loc[employeeLogin['Department'] == "Sales", 'role'] = 'sales'
employeeLogin.loc[employeeLogin['Department'] == "Information Technology", 'role'] = 'admin'
employeeLogin.loc[employeeLogin['Department'] == "Engineering", 'role'] = 'engineer'
employeeLogin.head()
employeeLogin.drop('Department', axis=1, inplace=True)
employeeLogin.head()

   employeeID    userID      role
0       10001    sgreen  engineer
1       10002      syip     sales
2       10003      skim  engineer
3       10004  sjohnson     sales
4       10005   sharlow     sales

In [76]:
employeeLogin.to_csv('../erp_app/Data/employeeLogin.csv',index = False)

In [10]:
order['employeeID'].head()
employee['employeeID'].head()
customer['customerID'].head()
order['customerID'].head()


pandas.merge(order,employee,on='employeeID')

,orderNumber,customerID,employeeID,modelNumber,saleValue,FirstName,MiddleName,LastName,Salary,Salaried,Hourly,Department
0,100001,10,10002,1001,NaN,Sherman,Ken,Yip,45000,True,False,Sales
1,100002,9,10002,1004,NaN,Sherman,Ken,Yip,45000,True,False,Sales
2,100003,8,10002,1002,NaN,Sherman,Ken,Yip,45000,True,False,Sales
3,100004,7,10002,1004,NaN,Sherman,Ken,Yip,45000,True,False,Sales
4,100005,1,10004,1004,NaN,Sahas,Karl,Johnson,45000,True,False,Sales
5,100008,4,10004,1003,NaN,Sahas,Karl,Johnson,45000,True,False,Sales
6,100012,5,10004,1005,NaN,Sahas,Karl,Johnson,45000,True,False,Sales
7,100014,7,10004,1001,NaN,Sahas,Karl,Johnson,45000,True,False,Sales
8,100006,2,10005,1001,NaN,Sudeep,Sunil,Harlow,55000,True,False,Sales
9,100010,6,10005,1004,NaN,Sudeep,Sunil,Harlow,55000,True,False,Sales
10,100015,3,10005,1004,NaN,Sudeep,Sunil,Harlow,55000,True,False,Sales
11,100016,4,10005,1004,NaN,Sudeep,Sunil,Harlow,55000,True,False,Sales
12,100007,3,10008,1004,NaN,Tim,B,Crisp,55000,True,False,Sales
13,100009,5,10008,1005,NaN,Tim,B,Crisp,55000,True,False,Sales
14,100011,10,10008,1005,NaN,Tim,B,Crisp,55000,True,False,Sales
15,100013,6,10008,1004,NaN,Tim,B,Crisp,55000,True,False,Sales
16,100017,5,10010,1003,NaN,Tyrone,Carter,Mayfield,45000,True,False,Sales
17,100018,2,10010,1003,NaN,Tyrone,Carter,Mayfield,45000,True,False,Sales
18,100019,2,10010,1001,NaN,Tyrone,Carter,Mayfield,45000,True,False,Sales

In [13]:
pandas.merge(pandas.merge(order,model), inventory).head()

,orderNumber,customerID,employeeID,modelNumber,saleValue,salePrice,inventoryID,cost,leadTime,categoryType,amount
0,100001,10,10002,1001,NaN,150,101,100,10,small,100
1,100006,2,10005,1001,NaN,150,101,100,10,small,100
2,100014,7,10004,1001,NaN,150,101,100,10,small,100
3,100019,2,10010,1001,NaN,150,101,100,10,small,100
4,100002,9,10002,1004,NaN,100,104,50,5,small,200

In [29]:
order = pandas.merge(order,model[['modelNumber','salePrice']])
order.head()

   orderNumber  customerID  employeeID  modelNumber  saleValue  salePrice
0       100001          10       10002         1001        150        150
1       100006           2       10005         1001        100        150
2       100014           7       10004         1001        550        150
3       100019           2       10010         1001        625        150
4       100002           9       10002         1004        150        100

In [30]:
order['saleValue'] = order['salePrice']

In [34]:
order.head()
order.drop('salePrice', axis=1, inplace=True)
order.head()

KeyError: "['salePrice'] not found in axis"

In [38]:
order.to_csv('../erp_app/Data/order.csv',index = False)

In [39]:
pandas.merge(order,model[['modelNumber','salePrice']])

    orderNumber  customerID  employeeID  modelNumber  saleValue  salePrice
0        100001          10       10002         1001        150        150
1        100006           2       10005         1001        150        150
2        100014           7       10004         1001        150        150
3        100019           2       10010         1001        150        150
4        100002           9       10002         1004        100        100
5        100004           7       10002         1004        100        100
6        100005           1       10004         1004        100        100
7        100007           3       10008         1004        100        100
8        100010           6       10005         1004        100        100
9        100013           6       10008         1004        100        100
10       100015           3       10005         1004        100        100
11       100016           4       10005         1004        100        100
12       100003           8       10002         1002        220        220
13       100008           4       10004         1003        550        550
14       100017           5       10010         1003        550        550
15       100018           2       10010         1003        550        550
16       100009           5       10008         1005        625        625
17       100011          10       10008         1005        625        625
18       100012           5       10004         1005        625        625

In [26]:
# Admin report #1: total revenue from sale, assoc employee and customer
orderNumber = str(10001)
pandas.merge(pandas.merge(order,employee, on="employeeID"), customer, on="customerID").query('orderNumber == ' + orderNumber)

Empty DataFrame
Columns: [orderNumber, customerID, employeeID, modelNumber, saleValue, FirstName_x, MiddleName, LastName_x, Salary, Salaried, Hourly, Department, FirstName_y, LastName_y]
Index: []

In [77]:
unpwd = employeeLogin
unpwd.head()

   employeeID    userID      role
0       10001    sgreen  engineer
1       10002      syip     sales
2       10003      skim  engineer
3       10004  sjohnson     sales
4       10005   sharlow     sales

In [78]:
unpwd.drop(['employeeID'],axis = 1, inplace = True)

In [79]:
unpwd['pw'] = 'p@ssw0rd'

In [80]:
unpwd.to_csv('../erp_app/Data/unpwd.csv',index = False)

In [87]:
unpwd.head()

     userID      role        pw
0    sgreen  engineer  p@ssw0rd
1      syip     sales  p@ssw0rd
2      skim  engineer  p@ssw0rd
3  sjohnson     sales  p@ssw0rd
4   sharlow     sales  p@ssw0rd

In [97]:

un = 'sgreen'
unpwd.query('userID == "' + str(un) + '"')['pw']
pw = 'p@ssw0rd'
if unpwd.query('userID == "' + str(un) + '"')['pw'][0] == pw:
    print(True)

True

In [96]:
if un in unpwd['userID']:
    print(True)

In [104]:
if 'sgreen' in list(unpwd['userID']):
    print(True)

True

In [103]:
unpwd['userID'].list()

AttributeError: 'Series' object has no attribute 'list'